<a href="https://colab.research.google.com/github/G0rav/DL_Class/blob/main/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DataFrame (not Dataframe or dataframe)

In [ ]:
import pandas as pd
data_list1d = [1,2,'n',4,5]
print('data_list:')
print(data_list1d)
data_list2d = [[1,'gaurav',3,4,5],[6,'jain',8]]
print('data_list2d:')
print(data_list2d)

data_list:
[1, 2, 'n', 4, 5]
data_list2d:
[[1, 'gaurav', 3, 4, 5], [6, 'jain', 8]]

In [ ]:
dataframe_list1d = pd.DataFrame(data_list1d)
print('dataframe_list1d:')
dataframe_list1d

dataframe_list1d:

   0
0  1
1  2
2  n
3  4
4  5

In [ ]:
dataframe_list2d = pd.DataFrame(data_list2d,index=['row1','row2'])
print('dataframe_list2d:')
dataframe_list2d

dataframe_list2d:

      0       1  2    3    4
row1  1  gaurav  3  4.0  5.0
row2  6    jain  8  NaN  NaN

## In Dictionaries array length should be same.
### index change the name of row

In [ ]:
data_dict = {'Name':['Gaurav','rishabh','Ram','shyam'],'Marks':[5,6,9,8]}
print('data_dict')
print(data_dict)
print()

dataframe_dict = pd.DataFrame(data_dict, index = ['r1','r2','r3','r4'])
print('dataframe_dict:')
dataframe_dict

data_dict
{'Name': ['Gaurav', 'rishabh', 'Ram', 'shyam'], 'Marks': [5, 6, 9, 8]}

dataframe_dict:

       Name  Marks
r1   Gaurav      5
r2  rishabh      6
r3      Ram      9
r4    shyam      8

In [ ]:
data_tuple1d = (1,2,'string')
print('data_tuple1d')
print(data_tuple1d)
data_tuple2d = ((1,'gaurav',3),(4,5))
print('data_tuple2d')
print(data_tuple2d)

data_tuple1d
(1, 2, 'string')
data_tuple2d
((1, 'gaurav', 3), (4, 5))

In [ ]:
dataframe_tuple1d = pd.DataFrame(data_tuple1d)
print('dataframe_tuple1d')
dataframe_tuple1d

dataframe_tuple1d

        0
0       1
1       2
2  string

## changing column names without dictionary

In [ ]:
dataframe_tuple2d = pd.DataFrame(data_tuple2d)
dataframe_tuple2d.columns=['a','b','c']
print('dataframe_tuple2d')
dataframe_tuple2d

dataframe_tuple2d

   a       b    c
0  1  gaurav  3.0
1  4       5  NaN

In [ ]:
print(dataframe_tuple2d.columns)

Index(['a', 'b', 'c'], dtype='object')